Repository: yangzichao/JustSessions
Catalog: Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Reopen the tabs that were open when JustSessions quit
zh_hans: 重新打开上次退出 JustSessions 时的标签

source: Reopening tabs
zh_hans: 恢复标签

source: Report an issue ↗
zh_hans: 报告问题 ↗

source: Report by Email
zh_hans: 通过邮件报告

source: Report on GitHub
zh_hans: 在 GitHub 上报告

source: Reporting the crash helps get it fixed. The report opens with the crash details filled in: add what you were doing, then send it. The crash report file shows in Finder, so you can attach it.
zh_hans: 报告这次崩溃，能帮我们修复它。报告打开时已填好崩溃详情：补充你当时在做什么，然后发送。崩溃报告文件会在访达中显示，方便你附上。

source: Requires passwordless SSH.
zh_hans: 需要 SSH 免密登录。

source: Restore
zh_hans: 恢复

source: Restore %@
zh_hans: 恢复 %@

source: Restore Defaults
zh_hans: 恢复默认设置

source: Restores the terminal colors, font, and size.
zh_hans: 恢复终端的配色、字体和字号。

source: Resume
zh_hans: 继续

source: Resume %lld sessions
zh_hans: 继续 %lld 个会话

source: Resume or branch
zh_hans: 继续或分支

source: Reveal session file in Finder
zh_hans: 在 Finder 中显示会话文件

source: Reverse Views
zh_hans: 反转视图

source: Reverse views
zh_hans: 反转视图

source: Right-click a selected row in the sidebar to resume, branch, or delete them.
zh_hans: 右键点击侧栏中已选择的条目，以继续、创建分支或删除会话。

source: Right-click a session to rename, pin, export, or delete it, and a project to rename, pin, or archive it. ⌘-click or ⇧-click selects several.
zh_hans: 右键单击会话可以重命名、置顶、导出或删除；右键单击项目可以重命名、置顶或归档。按住 ⌘ 或 ⇧ 单击可选择多个。

source: Right-click a session to rename, pin, export, or delete it. ⌘-click or Shift-click to select several at once.
zh_hans: 右键单击会话可以重命名、置顶、导出或删除。按住 ⌘ 或 Shift 单击可一次选择多个。

source: Right-click another tab and choose **New split view with current tab**. Drag between the two views to resize them.
zh_hans: 右键单击另一个标签页，选择 **使用当前标签页创建新的拆分视图**。在两个视图之间拖动可调整大小。

source: SSH alias or user@hostname
zh_hans: SSH 别名或 user@hostname

source: SSH aliases come from `~/.ssh/config`.
zh_hans: SSH 别名在 `~/.ssh/config` 中配置。

source: SSH host
zh_hans: SSH 主机

source: SSH hosts
zh_hans: SSH 主机

source: SSH hosts don't tell when a session waits for you
zh_hans: SSH 主机不会告知会话何时在等待你

source: SSH hosts have no Trash, so every session is permanently deleted.
zh_hans: SSH 主机没有废纸篓，因此所有会话都将被永久删除。

source: SSH setup guide ↗
zh_hans: SSH 配置指南 ↗

source: SSH setup in the user guide ↗
zh_hans: 用户指南中的 SSH 设置 ↗

source: Save
zh_hans: 保存

source: Save messages and tool-call summaries to a file
zh_hans: 将消息和工具调用摘要保存到文件

source: Scanning conversations
zh_hans: 正在扫描对话

source: Scanning sessions…
zh_hans: 正在扫描会话…

source: Search covers the entries shown in this preview.
zh_hans: 搜索范围为此预览中显示的记录。

source: Search open tabs
zh_hans: 搜索已打开的标签

source: Search open tabs by title, project, or host
zh_hans: 按标题、项目或主机搜索已打开的标签

source: Search projects and sessions
zh_hans: 搜索项目和会话

source: Search projects by name or path and sessions by title, ID, or message text
zh_hans: 按名称或路径搜索项目，按标题、ID 或消息内容搜索会话

source: Search projects by name or path, and sessions by title, ID, or message text.
zh_hans: 按名称或路径搜索项目，按标题、ID 或消息内容搜索会话。

source: Search the text of the conversation you are reading. ⌘F does the same.
zh_hans: 在正在阅读的对话中搜索文字。⌘F 也可以。

# Searching messages… %lld of %lld
source: Searching messages… %1$lld of %2$lld
zh_hans: 正在搜索消息… %1$lld / %2$lld

source: Searching…
zh_hans: 正在搜索…

source: Select a range
zh_hans: 选择一个范围

source: Select several sessions or projects
zh_hans: 选择多个会话或项目

source: Send us feedback ↗
zh_hans: 发送反馈 ↗

source: Separate Views
zh_hans: 取消拆分视图

source: Separate views
zh_hans: 取消拆分视图

source: Session %lld of %lld
zh_hans: 会话 %lld / %lld

source: Sessions on %1$@ open a shell instead of their CLI, because its shell startup runs %2$@ first. Click for how to fix it.
zh_hans: %1$@ 上的会话会打开 shell 而不是它们的 CLI，因为它的 shell 启动配置会先运行 %2$@。单击查看修复方法。

source: Sessions on %@ open a shell instead of their CLI, because its shell startup starts another program first. Click for how to fix it.
zh_hans: %@ 上的会话会打开 shell 而不是它们的 CLI，因为它的 shell 启动配置会先启动另一个程序。单击查看修复方法。

source: Sessions on other machines
zh_hans: 其他机器上的会话

source: Settings
zh_hans: 设置

source: Settings (⌘,)
zh_hans: 设置（⌘,）

source: Settings…
zh_hans: 设置…

source: Setup requirements
zh_hans: 配置要求

source: Shell startup help
zh_hans: Shell 启动配置帮助

source: Shell startup in the user guide ↗
zh_hans: 用户指南中的 shell 启动配置 ↗

source: Shell startup is fine
zh_hans: Shell 启动配置正常

source: Show
zh_hans: 显示

source: Show %@
zh_hans: 显示 %@

source: Show %lld subagent sessions
zh_hans: 显示 %lld 个子代理会话

source: Show Sidebar
zh_hans: 显示侧栏

source: Show explanation
zh_hans: 查看说明

source: Show in Other Window
zh_hans: 在另一个窗口中显示

source: Show sidebar
zh_hans: 显示侧栏

source: Show sidebar (⌘B)
zh_hans: 显示侧栏（⌘B）

source: Show subagent sessions of %@
zh_hans: 显示 %@ 的子代理会话

source: Show subagents under the sessions that started them
zh_hans: 在启动子代理的会话下显示子代理

source: Sidebar
zh_hans: 侧栏

source: Sidebar width
zh_hans: 侧栏宽度

source: Size
zh_hans: 字号

source: Skip
zh_hans: 跳过

source: Smaller reading text
zh_hans: 减小阅读字号

source: Smaller text
zh_hans: 减小字号

source: Some colors are missing, such as the text or background color.
zh_hans: 缺少部分颜色，例如文字或背景颜色。

source: Split View Resize Handle (draggable)
zh_hans: 拆分视图下大小调整手柄（可拖动）

source: Start a native CLI or a plain terminal in a project folder.
zh_hans: 在项目文件夹中启动原生 CLI 或普通终端。

source: Start a new session in %@
zh_hans: 在 %@ 中新建会话

# Start a new session in %@ on %@
source: Start a new session in %1$@ on %2$@
zh_hans: 在 %2$@ 的 %1$@ 中新建会话

source: Start a session in any installed CLI, or open a plain terminal, in a project folder. ⌘N does the same.
zh_hans: 在项目文件夹中用任一已安装的 CLI 开始会话，或打开普通终端。⌘N 也可以。

source: Start command
zh_hans: 启动命令

source: Start session
zh_hans: 开始会话

source: Start something new
zh_hans: 开始新的工作

source: Startup
zh_hans: 启动

source: Stop deleting after the current session; the rest stay listed
zh_hans: 删除当前会话后停止；保留其余会话

source: Stopping deletion
zh_hans: 正在停止删除

source: Stopping…
zh_hans: 正在停止…

source: Subagent
zh_hans: 子代理

source: Subagent of %@
zh_hans: %@ 的子代理

source: Subagents
zh_hans: 子代理

source: Supports local Claude Code, Codex, Pi, and OpenCode, including sessions running in tmux without an open tab. Sessions you are viewing do not notify you. Click a notification to open its session.
zh_hans: 支持本机的 Claude Code、Codex、Pi 和 OpenCode，包括在 tmux 中运行但未打开标签的会话。正在查看的会话不发送通知。点击通知可打开会话。

source: Swap with left view
zh_hans: 与左侧视图交换

source: Swap with right view
zh_hans: 与右侧视图交换

source: Switches between a readable width and the full window width
zh_hans: 在适合阅读的宽度和窗口全宽之间切换

source: System
zh_hans: 跟随系统

source: System Monospaced
zh_hans: 系统等宽字体

source: System Monospaced can't show the included Nerd Font icons. To see them, as in shell prompts, choose another font, such as Menlo.
zh_hans: 系统等宽字体无法显示内置的 Nerd Font 图标。若要显示这些图标（例如 shell 提示符中的图标），请选择其他字体，例如 Menlo。

source: Tab %lld
zh_hans: 标签 %lld

source: Tabs
zh_hans: 标签

source: Tabs and split view
zh_hans: 标签页与拆分视图

source: Tabs and windows
zh_hans: 标签页和窗口

source: Tabs grouped by project
zh_hans: 标签页按项目分组

source: Take the Tour
zh_hans: 查看引导

source: Take the tour
zh_hans: 查看引导

source: Terminal
zh_hans: 终端

source: Terminal appearance preview
zh_hans: 终端外观预览

source: Terminal colors
zh_hans: 终端配色

source: The Antigravity session database, associated folder, and annotations will move to the macOS Trash. This also removes its entry from Antigravity's local index.
zh_hans: Antigravity 会话数据库、关联文件夹和注释将移到 macOS 废纸篓，并从 Antigravity 本地索引中移除。

source: The Claude Code session file and its associated folder will move to the macOS Trash. This also removes its entry from Claude Code's local index.
zh_hans: Claude Code 会话文件及其关联文件夹将移到 macOS 废纸篓，并从 Claude Code 本地索引中移除。

source: The Pi session file and its associated folder will be permanently deleted on %@. SSH hosts have no Trash, so this cannot be undone.
zh_hans: %@ 上的 Pi 会话文件及其关联文件夹将被永久删除。SSH 主机没有废纸篓，此操作无法撤销。

source: The Pi session file and its associated folder will move to the macOS Trash.
zh_hans: Pi 会话文件及其关联文件夹将移到 macOS 废纸篓。

source: The folder is listed under %@ in the sidebar, ready for new sessions.
zh_hans: 该文件夹会列在侧边栏的 %@ 下，可直接在其中新建会话。

source: The host needs:
zh_hans: 主机需要：

source: The project folder is no longer at %@. Move it back there to resume this session.
zh_hans: 项目文件夹已不在 %@。把它移回原处即可继续这个会话。

source: The project folder no longer exists
zh_hans: 项目文件夹已不存在

source: The project will be archived; skipped sessions stay on disk and come back when it is restored.
zh_hans: 项目将被归档；被跳过的会话仍保留在磁盘上，恢复项目后会重新显示。

source: The project will stay in the sidebar.
zh_hans: 项目仍会保留在侧栏中。

source: The projects will be archived; skipped sessions stay on disk and come back when they are restored.
zh_hans: 项目将被归档；被跳过的会话仍保留在磁盘上，恢复项目后会重新显示。

source: The shell and anything still running in it will stop.
zh_hans: shell 及其中仍在运行的进程都会停止。

source: The sidebar lists sessions from %@ by host and project. Search matches project names and paths, session titles and IDs, and message text.
zh_hans: 侧边栏按主机和项目列出来自 %@ 的会话。搜索可匹配项目名称和路径、会话标题和 ID，以及消息内容。

source: The terminal process will stop. Sessions saved by the CLI will appear in the project list after refresh.
zh_hans: 终端进程会停止。CLI 已保存的会话将在刷新后出现在项目列表中。

source: The tmux sessions the app starts on a host have no prefix key, so every key reaches the CLI. To use your own tmux prefix there, point at the host's heading, click its **⋯**, and choose **Use this host's tmux prefix**.
zh_hans: App 在主机上启动的 tmux 会话没有前缀键，所以每个按键都会传给 CLI。如果想在那里使用你自己的 tmux 前缀键，请将指针移到该主机的标题上，点按它的 **⋯**，然后选择 **使用此主机的 tmux 前缀键**。

source: The tour points at the main controls in the window. Afterwards, tips show again the first time you use each part, such as tabs or split view.
zh_hans: 引导会指出窗口中的主要控件。之后，你第一次用到各个部分时（例如标签页或拆分视图），提示会再次出现。

source: Theme
zh_hans: 主题

# There is no folder %@ on %@. Create it to add the project.
source: There is no folder %1$@ on %2$@. Create it to add the project.
zh_hans: %2$@ 上没有文件夹 %1$@。创建它即可添加此项目。

source: This Mac
zh_hans: 此 Mac

source: This affects all tools in %@, including sessions hidden by the current filter.
zh_hans: 此操作会影响 %@ 中所有工具的会话，包括被当前筛选条件隐藏的会话。

source: This affects all tools in %lld projects, including sessions hidden by the current filter.
zh_hans: 此操作会影响 %lld 个项目中所有工具的会话，包括被当前筛选条件隐藏的会话。

source: This also deletes %lld subagent sessions.
zh_hans: 同时会删除 %lld 个子代理会话。

source: This also deletes 1 subagent session.
zh_hans: 同时会删除 1 个子代理会话。

source: This changes the display name in JustSessions.
zh_hans: 仅修改 JustSessions 中的显示名称。

source: This file isn't an iTerm2 color preset.
zh_hans: 此文件不是 iTerm2 配色预设。

source: This session is open in another window.
zh_hans: 这个会话已在另一个窗口中打开。

source: This session will be permanently deleted on %@. SSH hosts have no Trash, so this cannot be undone.
zh_hans: %@ 上的此会话将被永久删除。SSH 主机没有废纸篓，此操作无法撤销。

source: Time range
zh_hans: 时间范围

source: Tool
zh_hans: 工具

source: Try Again
zh_hans: 重试

source: Try again
zh_hans: 重试

source: Two tabs side by side
zh_hans: 两个标签页并排显示

source: Unknown error
zh_hans: 未知错误

source: Unpin project
zh_hans: 取消置顶项目

source: Unpin session
zh_hans: 取消置顶会话

source: Use a readable width
zh_hans: 使用适合阅读的宽度

source: Use default
zh_hans: 使用默认

source: Use the full window width
zh_hans: 使用窗口全宽

source: Use this host's tmux prefix
zh_hans: 使用此主机的 tmux 前缀键

source: User guide ↗
zh_hans: 用户指南 ↗

source: Waiting for you
zh_hans: 等待我处理

source: Website ↗
zh_hans: 网站 ↗

source: When you close a tab
zh_hans: 关闭标签时

source: When you close this tab, choose **Keep running**: the CLI carries on, even after you quit. Click its session to return.
zh_hans: 关闭这个标签页时选择 **保持运行**：CLI 会继续运行，退出 App 后也不会停。单击它的会话即可回来。

source: You
zh_hans: 你

source: Your login shell, with no CLI
zh_hans: 你的登录 shell，不运行 CLI

source: Your sessions will appear here
zh_hans: 你的会话会显示在这里

source: Your sessions, already here
zh_hans: 你的会话已经在这里

source: Your shell startup keeps CLIs from starting!
zh_hans: 你的 shell 启动配置使 CLI 无法启动！

source: `python3`, for Antigravity and OpenCode
zh_hans: `python3`，用于 Antigravity 和 OpenCode

source: `rsync`, and the CLIs you use
zh_hans: `rsync`，以及你使用的 CLI

source: `tmux`, so a CLI keeps running when the connection drops
zh_hans: `tmux`，这样连接断开时 CLI 也会继续运行

source: iTerm2 Color Preset File…
zh_hans: iTerm2 配色预设文件…

source: iTerm2 Default Profile
zh_hans: iTerm2 默认 Profile

source: iTerm2 has no saved settings on this Mac.
zh_hans: 这台 Mac 上没有 iTerm2 的设置。

source: macOS asks for these on behalf of JustSessions, also when a CLI in one of its terminals needs one. Checking here never shows a prompt.
zh_hans: macOS 以 JustSessions 的名义请求这些权限，终端中的 CLI 需要时也是如此。在这里检查不会弹出任何请求。

source: macOS asks the first time JustSessions needs it.
zh_hans: macOS 会在 JustSessions 第一次需要时询问。

source: macOS doesn't let apps check this. Look for JustSessions in System Settings.
zh_hans: macOS 不允许应用检查这项权限。请在系统设置中找到 JustSessions。

source: ⇧-click
zh_hans: ⇧ 点击

source: ⌘-click
zh_hans: ⌘ 点击
